Samsung/TizenRT/os/arch/xtensa/src/esp32/chip/esp32_i2s_reg.h
#define I2S_LC_STATE0_REG(i)          (REG_I2S_BASE(i) + 0x006C)
/* I2S_LC_STATE0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define I2S_LC_STATE0  0xFFFFFFFF
#define I2S_LC_STATE0_M  ((I2S_LC_STATE0_V) << (I2S_LC_STATE0_S))
#define I2S_LC_STATE0_V  0xFFFFFFFF
#define I2S_LC_STATE0_S  0

#define I2S_LC_STATE1_REG(i)          (REG_I2S_BASE(i) + 0x0070)
/* I2S_LC_STATE1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define I2S_LC_STATE1  0xFFFFFFFF
#define I2S_LC_STATE1_M  ((I2S_LC_STATE1_V) << (I2S_LC_STATE1_S))
#define I2S_LC_STATE1_V  0xFFFFFFFF
#define I2S_LC_STATE1_S  0

#define I2S_LC_HUNG_CONF_REG(i)          (REG_I2S_BASE(i) + 0x0074)
/* I2S_LC_FIFO_TIMEOUT_ENA : R/W ;bitpos:[11] ;default: 1'b1 ; */
/*description: */
#define I2S_LC_FIFO_TIMEOUT_ENA  (BIT(11))
#define I2S_LC_FIFO_TIMEOUT_ENA_M  (BIT(11))
#define I2S_LC_FIFO_TIMEOUT_ENA_V  0x1
#define I2S_LC_FIFO_TIMEOUT_ENA_S  11
/* I2S_LC_FIFO_TIMEOUT_SHIFT : R/W ;bitpos:[10:8] ;default: 3'b0 ; */
/*description: */
#define I2S_LC_FIFO_TIMEOUT_SHIFT  0x00000007
#define I2S_LC_FIFO_TIMEOUT_SHIFT_M  ((I2S_LC_FIFO_TIMEOUT_SHIFT_V) << (I2S_LC_FIFO_TIMEOUT_SHIFT_S))
#define I2S_LC_FIFO_TIMEOUT_SHIFT_V  0x7
#define I2S_LC_FIFO_TIMEOUT_SHIFT_S  8
/* I2S_LC_FIFO_TIMEOUT : R/W ;bitpos:[7:0] ;default: 8'h10 ; */
/*description: */
#define I2S_LC_FIFO_TIMEOUT  0x000000FF
#define I2S_LC_FIFO_TIMEOUT_M  ((I2S_LC_FIFO_TIMEOUT_V) << (I2S_LC_FIFO_TIMEOUT_S))
#define I2S_LC_FIFO_TIMEOUT_V  0xFF
#define I2S_LC_FIFO_TIMEOUT_S  0

#define I2S_CVSD_CONF0_REG(i)          (REG_I2S_BASE(i) + 0x0080)
/* I2S_CVSD_Y_MIN : R/W ;bitpos:[31:16] ;default: 16'h8000 ; */
/*description: */
#define I2S_CVSD_Y_MIN  0x0000FFFF
#define I2S_CVSD_Y_MIN_M  ((I2S_CVSD_Y_MIN_V) << (I2S_CVSD_Y_MIN_S))
#define I2S_CVSD_Y_MIN_V  0xFFFF
#define I2S_CVSD_Y_MIN_S  16
/* I2S_CVSD_Y_MAX : R/W ;bitpos:[15:0] ;default: 16'h7fff ; */
/*description: */
#define I2S_CVSD_Y_MAX  0x0000FFFF
#define I2S_CVSD_Y_MAX_M  ((I2S_CVSD_Y_MAX_V) << (I2S_CVSD_Y_MAX_S))
#define I2S_CVSD_Y_MAX_V  0xFFFF
#define I2S_CVSD_Y_MAX_S  0

#define I2S_CVSD_CONF1_REG(i)          (REG_I2S_BASE(i) + 0x0084)
/* I2S_CVSD_SIGMA_MIN : R/W ;bitpos:[31:16] ;default: 16'd10 ; */
/*description: */
#define I2S_CVSD_SIGMA_MIN  0x0000FFFF
#define I2S_CVSD_SIGMA_MIN_M  ((I2S_CVSD_SIGMA_MIN_V) << (I2S_CVSD_SIGMA_MIN_S))
#define I2S_CVSD_SIGMA_MIN_V  0xFFFF
#define I2S_CVSD_SIGMA_MIN_S  16
/* I2S_CVSD_SIGMA_MAX : R/W ;bitpos:[15:0] ;default: 16'd1280 ; */
/*description: */
#define I2S_CVSD_SIGMA_MAX  0x0000FFFF
#define I2S_CVSD_SIGMA_MAX_M  ((I2S_CVSD_SIGMA_MAX_V) << (I2S_CVSD_SIGMA_MAX_S))
#define I2S_CVSD_SIGMA_MAX_V  0xFFFF
#define I2S_CVSD_SIGMA_MAX_S  0

#define I2S_CVSD_CONF2_REG(i)          (REG_I2S_BASE(i) + 0x0088)
/* I2S_CVSD_H : R/W ;bitpos:[18:16] ;default: 3'd5 ; */
/*description: */
#define I2S_CVSD_H  0x00000007
#define I2S_CVSD_H_M  ((I2S_CVSD_H_V) << (I2S_CVSD_H_S))
#define I2S_CVSD_H_V  0x7
#define I2S_CVSD_H_S  16
/* I2S_CVSD_BETA : R/W ;bitpos:[15:6] ;default: 10'd10 ; */
/*description: */
#define I2S_CVSD_BETA  0x000003FF
#define I2S_CVSD_BETA_M  ((I2S_CVSD_BETA_V) << (I2S_CVSD_BETA_S))
#define I2S_CVSD_BETA_V  0x3FF
#define I2S_CVSD_BETA_S  6
/* I2S_CVSD_J : R/W ;bitpos:[5:3] ;default: 3'h4 ; */
/*description: */
#define I2S_CVSD_J  0x00000007
#define I2S_CVSD_J_M  ((I2S_CVSD_J_V) << (I2S_CVSD_J_S))
#define I2S_CVSD_J_V  0x7
#define I2S_CVSD_J_S  3
/* I2S_CVSD_K : R/W ;bitpos:[2:0] ;default: 3'h4 ; */
/*description: */
#define I2S_CVSD_K  0x00000007
#define I2S_CVSD_K_M  ((I2S_CVSD_K_V) << (I2S_CVSD_K_S))
#define I2S_CVSD_K_V  0x7
#define I2S_CVSD_K_S  0

#define I2S_PLC_CONF0_REG(i)          (REG_I2S_BASE(i) + 0x008C)
/* I2S_N_MIN_ERR : R/W ;bitpos:[27:25] ;default: 3'd4 ; */
/*description: */
#define I2S_N_MIN_ERR  0x00000007
#define I2S_N_MIN_ERR_M  ((I2S_N_MIN_ERR_V) << (I2S_N_MIN_ERR_S))
#define I2S_N_MIN_ERR_V  0x7
#define I2S_N_MIN_ERR_S  25
/* I2S_PACK_LEN_8K : R/W ;bitpos:[24:20] ;default: 5'd10 ; */
/*description: */
#define I2S_PACK_LEN_8K  0x0000001F
#define I2S_PACK_LEN_8K_M  ((I2S_PACK_LEN_8K_V) << (I2S_PACK_LEN_8K_S))
#define I2S_PACK_LEN_8K_V  0x1F
#define I2S_PACK_LEN_8K_S  20
/* I2S_MAX_SLIDE_SAMPLE : R/W ;bitpos:[19:12] ;default: 8'd128 ; */
/*description: */
#define I2S_MAX_SLIDE_SAMPLE  0x000000FF
#define I2S_MAX_SLIDE_SAMPLE_M  ((I2S_MAX_SLIDE_SAMPLE_V) << (I2S_MAX_SLIDE_SAMPLE_S))
#define I2S_MAX_SLIDE_SAMPLE_V  0xFF
#define I2S_MAX_SLIDE_SAMPLE_S  12
/* I2S_SHIFT_RATE : R/W ;bitpos:[11:9] ;default: 3'h1 ; */
/*description: */
#define I2S_SHIFT_RATE  0x00000007
#define I2S_SHIFT_RATE_M  ((I2S_SHIFT_RATE_V) << (I2S_SHIFT_RATE_S))
#define I2S_SHIFT_RATE_V  0x7
#define I2S_SHIFT_RATE_S  9
/* I2S_N_ERR_SEG : R/W ;bitpos:[8:6] ;default: 3'h4 ; */
/*description: */
#define I2S_N_ERR_SEG  0x00000007
#define I2S_N_ERR_SEG_M  ((I2S_N_ERR_SEG_V) << (I2S_N_ERR_SEG_S))
#define I2S_N_ERR_SEG_V  0x7
#define I2S_N_ERR_SEG_S  6
/* I2S_GOOD_PACK_MAX : R/W ;bitpos:[5:0] ;default: 6'h39 ; */
/*description: */
#define I2S_GOOD_PACK_MAX  0x0000003F
#define I2S_GOOD_PACK_MAX_M  ((I2S_GOOD_PACK_MAX_V) << (I2S_GOOD_PACK_MAX_S))
#define I2S_GOOD_PACK_MAX_V  0x3F
#define I2S_GOOD_PACK_MAX_S  0

#define I2S_PLC_CONF1_REG(i)          (REG_I2S_BASE(i) + 0x0090)
/* I2S_SLIDE_WIN_LEN : R/W ;bitpos:[31:24] ;default: 8'd160 ; */
/*description: */
#define I2S_SLIDE_WIN_LEN  0x000000FF
#define I2S_SLIDE_WIN_LEN_M  ((I2S_SLIDE_WIN_LEN_V) << (I2S_SLIDE_WIN_LEN_S))
#define I2S_SLIDE_WIN_LEN_V  0xFF
#define I2S_SLIDE_WIN_LEN_S  24
/* I2S_BAD_OLA_WIN2_PARA : R/W ;bitpos:[23:16] ;default: 8'd23 ; */
/*description: */
#define I2S_BAD_OLA_WIN2_PARA  0x000000FF
#define I2S_BAD_OLA_WIN2_PARA_M  ((I2S_BAD_OLA_WIN2_PARA_V) << (I2S_BAD_OLA_WIN2_PARA_S))
#define I2S_BAD_OLA_WIN2_PARA_V  0xFF
#define I2S_BAD_OLA_WIN2_PARA_S  16
/* I2S_BAD_OLA_WIN2_PARA_SHIFT : R/W ;bitpos:[15:12] ;default: 4'd8 ; */
/*description: */
#define I2S_BAD_OLA_WIN2_PARA_SHIFT  0x0000000F
#define I2S_BAD_OLA_WIN2_PARA_SHIFT_M  ((I2S_BAD_OLA_WIN2_PARA_SHIFT_V) << (I2S_BAD_OLA_WIN2_PARA_SHIFT_S))
#define I2S_BAD_OLA_WIN2_PARA_SHIFT_V  0xF
#define I2S_BAD_OLA_WIN2_PARA_SHIFT_S  12
/* I2S_BAD_CEF_ATTEN_PARA_SHIFT : R/W ;bitpos:[11:8] ;default: 4'd10 ; */
/*description: */
#define I2S_BAD_CEF_ATTEN_PARA_SHIFT  0x0000000F
#define I2S_BAD_CEF_ATTEN_PARA_SHIFT_M  ((I2S_BAD_CEF_ATTEN_PARA_SHIFT_V) << (I2S_BAD_CEF_ATTEN_PARA_SHIFT_S))
#define I2S_BAD_CEF_ATTEN_PARA_SHIFT_V  0xF
#define I2S_BAD_CEF_ATTEN_PARA_SHIFT_S  8
/* I2S_BAD_CEF_ATTEN_PARA : R/W ;bitpos:[7:0] ;default: 8'd5 ; */
/*description: */
#define I2S_BAD_CEF_ATTEN_PARA  0x000000FF
#define I2S_BAD_CEF_ATTEN_PARA_M  ((I2S_BAD_CEF_ATTEN_PARA_V) << (I2S_BAD_CEF_ATTEN_PARA_S))
#define I2S_BAD_CEF_ATTEN_PARA_V  0xFF
#define I2S_BAD_CEF_ATTEN_PARA_S  0

#define I2S_PLC_CONF2_REG(i)          (REG_I2S_BASE(i) + 0x0094)
/* I2S_MIN_PERIOD : R/W ;bitpos:[6:2] ;default: 5'd10 ; */
/*description: */
#define I2S_MIN_PERIOD  0x0000001F
#define I2S_MIN_PERIOD_M  ((I2S_MIN_PERIOD_V) << (I2S_MIN_PERIOD_S))
#define I2S_MIN_PERIOD_V  0x1F
#define I2S_MIN_PERIOD_S  2
/* I2S_CVSD_SEG_MOD : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: */
#define I2S_CVSD_SEG_MOD  0x00000003
#define I2S_CVSD_SEG_MOD_M  ((I2S_CVSD_SEG_MOD_V) << (I2S_CVSD_SEG_MOD_S))
#define I2S_CVSD_SEG_MOD_V  0x3
#define I2S_CVSD_SEG_MOD_S  0

